package Ywk.Api;

import java.util.List;

public class WordData {

    /**
     * status : 200
     * msg :
     * data : {"prefix":["北京","东城区","西城区","崇文区","宣武区","朝阳区","海淀区","丰台区","通州区","顺义区","房山区","石景山区","门头沟区","大兴","昌平","延庆","怀柔","密云","平谷","天津","和平区","河东区","南开区","河西区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清","宝坻","蓟县","静海","宁河","河北","石家庄","邢台","邯郸","衡水","沧州","保定","廊坊","张家口","承德","唐山","秦皇岛","鹿泉","沙河","武安","南宫","冀州","藁城","晋州","辛集","深州","泊头","黄骅","新乐","安国","定州","河间","任丘","高碑店","涿州","霸州","遵化","丰南","迁安","三河","井陉","元氏","赞皇","高邑","临城","内丘","永年","涉县","磁县","临漳","魏县","大名","成安","肥乡","广平","馆陶","曲周","邱县","临西","南和","鸡泽","威县","任县","巨鹿","平乡","广宗","清河","故城","隆尧","柏乡","枣强","新河","宁晋","赵县","栾城","平山","灵寿","行唐","曲阳","唐县","望都","顺平","满城","阜平","易县","涞水","涞源","定兴","正定","无极","深泽","安平","饶阳","武强","武邑","献县","阜城","景县","吴桥","东光","南皮","沧县","盐山","海兴","青县","博野","蠡县","肃宁","清苑","高阳","大城","文安","安新","徐水","容城","雄县","永清","固安","蔚县","阳原","涿鹿","怀来","宣化","怀安","万全","尚义","崇礼","张北","康保","沽源","赤城","隆化","滦平","平泉","兴隆","迁西","玉田","丰润","卢龙","抚宁","滦县","昌黎","滦南","乐亭","唐海","香河","内蒙古","呼和浩特","包头","乌海","赤峰","呼伦贝尔","通辽","乌兰察布","鄂尔多斯","巴彦淖尔","满洲里","扎兰屯","牙克石","根河","额尔古纳","乌兰浩特","阿尔山","霍林郭勒","锡林浩特","二连浩特","丰镇","山西","太原","大同","忻州","阳泉","长治","晋城","朔州","晋中","运城","临汾","吕梁","古交","潞城","高平","介休","永济","河津","原平","侯马","霍州","孝义","汾阳","黑龙江","哈尔滨","大庆","齐齐哈尔黑河","伊春","牡丹江","鸡西","鹤岗","佳木斯","双鸭山","七台河","双城","肇东","安达","讷河","五大连池","北安","海伦","绥化","铁力","阿城","尚志","五常","海林","宁安","绥芬河","穆棱","富锦","同江","密山","虎林","呼兰","兰西","肇州","肇源","泰来","龙江","甘南","富裕","依安","克山","克东","嫩江","塔河","漠河","呼玛","孙吴","逊克","拜泉","林甸","明水","青冈","望奎","绥棱","庆安","嘉荫","萝北","巴彦","木兰","通河","方正","宾县","延寿","东宁","林口","鸡东","勃利","依兰","汤原","桦南","桦川","集贤","绥滨","友谊","宝清","饶河","抚远","吉林","长春","四平","白城","松原","辽源","通化","白山","双辽","洮南","大安","榆树","德惠","九台","舒兰","蛟河","敦化","图们","珲春","延吉","龙井","和龙","桦甸","磐石","梅河口","临江","集安","梨树","长岭","通榆","镇赉","乾安","扶余","农安","安图","汪清","永吉","东辽","东丰","辉南","柳河","靖宇","抚松","江源","辽宁","沈阳","盘锦","锦州","葫芦岛","朝阳","阜新","铁岭","抚顺","本溪","丹东","辽阳","鞍山","营口","大连","新民","北宁","凌海","兴城","凌源","北票","铁法","开原","凤城","灯塔","海城","大石桥","盖州","东港","庄河","瓦房店","普兰店","辽中","台安","盘山","大洼","绥中","建昌","建平","义县","黑山","彰武","法库","康平","昌图","西丰","长海","上海","黃浦区","南市区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦","奉贤","南汇","崇明","福建","福州","厦门","泉州","三明","南平","漳州","莆田","宁德","龙岩","福清市","长乐市","永安市","石狮市","晋江市","南安市","龙海市","邵武市","武夷山","建瓯市","建阳市","漳平市","福安市","福鼎市","安徽","合肥","滁州","蚌埠","淮南","淮北","阜阳","安庆","芜湖","马鞍山","铜陵","黄山","巢湖","天长","明光","宿州","亳州","界首","六安","桐城","宣州","贵池","宁国","肥东","含山","和县","无为","全椒","来安","定远","凤阳","五河","泗县","固镇","灵璧","濉溪","萧县","砀山","涡阳","太和","临泉","阜南","利辛","蒙城","怀远","凤台","颍上","寿县","长丰","霍邱","金寨","肥西","舒城","霍山","庐江","枞阳","岳西","潜山","太湖","怀宁","宿松","望江","当涂","繁昌","郎溪","广德","南陵","青阳","泾县","东至","石台","祁门","旌德","绩溪","歙县","休宁","黟县","江苏","南京","镇江","常州","无锡","苏州","扬州","泰州","南通","盐城","淮阴","宿迁","连云港","徐州","句容","丹阳","扬中","金坛","武进","溧阳","宜兴","江阴","张家港","常熟","太仓","昆山","锡山","吴县","吴江","仪征","江都","姜堰","泰兴","靖江","如皋","通州","海门","启东","高邮","兴化","东台","大丰","淮安","新沂","邳州","江宁","丹徒","溧水","高淳","江浦","六合","邗江","如东","海安","盐都","宝应","建湖","射阳","阜宁","滨海","涟水","灌南","响水","灌云","赣榆","东海","沭阳","泗阳","洪泽","金湖","盱眙","泗洪","宿豫","睢宁","铜山","丰县","沛县","江西","南昌","鹰潭","景德镇","九江","新余","萍乡","临川","贵溪","上饶","乐平","德兴","瑞昌","高安","丰城","樟树","宜春","吉安","井冈山","赣州","南康","瑞金","新建","进贤","东乡","余江","金溪","资溪","弋阳","横峰","铅山","广丰","玉山","余干","万年","波阳","婺源","浮梁","都昌","湖口","彭泽","星子","德安","永修","武宁","修水","铜鼓","靖安","奉新","安义","宜丰","上高","万载","分宜","芦溪","上栗","崇仁","宜黄","南城","黎川","南丰","广昌","石城","乐安","永丰","宁都","新干","峡江","吉水","安福","永新","莲花","宁冈","泰和","万安","兴国","遂川","赣县","上犹","崇义","大余","于都","会昌","信丰","安远","寻乌","全南","龙南","定南","山东","济南","德州","聊城","东营","淄博","潍坊","青岛","烟台","威海","济宁","泰安","莱芜","日照","临沂","枣庄","临清","禹城","乐陵","滨州","章丘","青州","寿光","昌邑","安丘","高密","胶州","胶南","即墨","平度","莱西","莱州","招远","龙口","蓬莱","栖霞","莱阳","海阳","乳山","文登","荣成","菏泽","肥城","曲阜","兖州","邹城","新泰","诸城","滕州","齐河","茌平","东阿","阳谷","莘县","冠县","夏津","高唐","武城","平原","陵县","临邑","济阳","宁津","商河","惠民","庆云","无棣","阳信","沾化","利津","垦利","邹平","高青","博兴","桓台","广饶","临朐","昌乐","长岛","东明","鄄城","郓城","梁山","巨野","嘉祥","汶上","东平","平阴","长清","宁阳","泗水","平邑","蒙阴","沂源","沂水","五莲","沂南","莒县","莒南","费县","临沭","定陶","曹县","成武","单县","金乡","鱼台","微山","苍山","郯城","浙江","杭州","嘉兴","湖州","绍兴","宁波","舟山","金华","衢州","台州","温州","余杭","海宁","桐乡","平湖","临安","富阳","萧山","上虞","慈溪","余姚","奉化","嵊州","诸暨","建德","义乌","东阳","兰溪","江山","永康","丽水","龙泉","临海","温岭","乐清","瑞安","海盐","嘉善","长兴","安吉","德清","鄞县","岱山","嵊泗","象山","宁海","三门","天台","新昌","桐庐","淳安","浦江","磐安","龙游","衢县","开化","常山","遂昌","松阳","武义","缙云","云和","庆元","泰顺","仙居","青田","永嘉","玉环","洞头","文成","平阳","苍南","河南","郑州","新乡","鹤壁","安阳","濮阳","开封","商丘","焦作","洛阳","三门峡","平顶山","南阳","许昌","漯河","信阳","辉县","卫辉","林州","永城","沁阳","济源","孟州","荥阳","新密","巩义","偃师","登封","新郑","长葛","禹州","汝州","义马","灵宝","舞钢","邓州","周口","项城","驻马店","原阳","淇县","汤阴","滑县","浚县","内黄","南乐","清丰","范县","台前","长垣","延津","封丘","中牟","兰考","民权","睢县","宁陵","虞城","夏邑","获嘉","修武","武陟","博爱","温县","襄城","郏县","宝丰","鲁山","伊川","宜阳","汝阳","嵩县","孟津","新安","渑池","陕县","洛宁","卢氏","栾川","西峡","淅川","内乡","镇平","南召","社旗","方城","叶县","临颍","郾城","舞阳","西平","遂平","泌阳","唐河","新野","桐柏","尉氏","通许","杞县","鄢陵","扶沟","太康","柘城","鹿邑","西华","淮阳","郸城","商水","沈丘","上蔡","汝南","平舆","确山","正阳","新蔡","罗山","息县","淮滨","固始","潢川","光山","商城","新县","湖北","武汉","襄樊","宜昌","黄石","鄂州","随州","荆州","荆门","十堰","孝感","黄冈","咸宁","大冶市","丹江口市","洪湖市","石首市","松滋市","宜都市","当阳市","枝江市","老河口市","枣阳市","宜城市","钟祥市","应城市","安陆市","汉川市","麻城市","武穴市","赤壁市","广水市","仙桃市","天门市","潜江市","恩施市","利川市","湖南","长沙","岳阳","株洲","衡阳","郴州","永州","湘潭","邵阳","怀化","益阳","常德","张家界","浏阳","汨罗","临湘","醴陵","耒阳","常宁","资兴","韶山","湘乡","娄底","涟源","冷水江","沅江","津市","吉首","洪江","武冈","湘阴","平江","衡山","衡东","衡南","攸县","茶陵","安仁","炎陵","桂东","永兴","汝城","宜章","临武","桂阳","新田","嘉禾","宁远","蓝山","双牌","道县","江永","双峰","邵东","新邵","祁东","祁阳","东安","望城","宁乡","桃江","汉寿","桃源","华容","南县","安乡","临澧","澧县","石门","慈利","桑植","龙山","永顺","花垣","保靖","古丈","沅陵","安化","泸溪","新化","溆浦","辰溪","凤凰","中方","洞口","隆回","新宁","绥宁","广东","广州","东莞","深圳","惠州","汕尾","汕头","揭阳","潮州","梅州","河源","韶关","清远","佛山","江门","中山","珠海","肇庆","云浮","阳江","茂名","湛江","增城","惠阳","陆丰","普宁","潮阳","澄海","兴宁","南雄","乐昌","连州","英德","从化","花都","三水","南海","番禺","顺德","高明","鹤山","新会","开平","台山","四会","高要","罗定","恩平","阳春","信宜","高州","吴川","化州","廉江","雷州","博罗","惠东","海丰","陆河","惠来","揭西","揭东","潮安","饶平","南澳","丰顺","大埔","蕉岭","平远","梅县","五华","龙川","和平","紫金","东源","连平","翁源","新丰","龙门","始兴","仁化","曲江","阳山","清新","佛冈","怀集","广宁","封开","郁南","德庆","云安","新兴","斗门","阳东","阳西","电白","遂溪","徐闻","海南","海口","三亚","琼海","文昌","万宁","东方","儋州","五指山","琼山","通什","定安","屯昌","临高","澄迈","广西","南宁","桂林","柳州","梧州","贵港","玉林","钦州","北海","防城港","崇左","百色","河池","来宾","贺州","岑溪","桂平","北流","东兴","凭祥","宜州","合山","贵州","贵阳","六盘水","遵义","清镇","安顺","兴义","毕节","仁怀","赤水","福泉","都匀","凯里","铜仁","平坝","惠水","长顺","普定","晴隆","普安","兴仁","贞丰","安龙","册亨","望谟","罗甸","织金","纳雍","水城","赫章","大方","黔西","修文","息烽","开阳","金沙","桐梓","习水","绥阳","正安","湄潭","凤冈","德江","思南","江口","石阡","岑巩","镇远","施秉","余庆","黄平","瓮安","龙里","贵定","麻江","台江","三穗","剑河","天柱","锦屏","黎平","榕江","从江","雷山","丹寨","独山","荔波","平塘","四川","成都","德阳","绵阳","广元","遂宁","南充","广安","内江","自贡","泸州","宜宾","乐山","攀枝花","广汉","什邡","绵竹","江油","阆中","巴中","万源","达川","华蓥","简阳","资阳","都江堰","彭州","崇州","邛崃","雅安","峨眉山","西昌","郫县","新都","金堂","罗江","安县","北川","平武","青川","剑阁","梓潼","中江","三台","盐亭","射洪","蓬溪","大英","西充","南部","苍溪","旺苍","南江","岳池","武胜","通江","平昌","仪陇","宣汉","达县","开江","蓬安","营山","渠县","大竹","邻水","乐至","安岳","资中","温江","大邑","双流","新津","宝兴","芦山","天全","名山","蒲江","丹棱","洪雅","眉山","彭山","青神","仁寿","夹江","井研","威远","荣县","隆昌","富顺","泸县","犍为","沐川","屏山","南溪","江安","合江","长宁","高县","珙县","筠连","兴文","叙永","古蔺","荥经","汉源","石棉","甘洛","越西","冕宁","喜德","美姑","雷波","昭觉","金阳","布拖","德昌","普格","宁南","盐源","米易","盐边","会理","会东","茂县","汶川","理县","松潘","九寨沟","若尔盖","红原","阿坝","黑水","马尔康","壤塘","色达","石渠","德格","甘孜","炉霍","道孚","新龙","白玉","金川","丹巴","小金","泸定","康定","雅江","理塘","巴塘","九龙","稻城","乡城","得荣","西藏","拉萨","日喀则","云南","昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","安宁市","宣威市","个旧市","开远市","景洪市","楚雄市","大理市","潞西市","瑞丽市","重庆","渝中区","江北区","南岸区","沙坪坝区","九龙坡区","大渡口区","巴南区","北碚区","双桥区","万盛区","渝北区","涪陵区","万州区","合川","永川","江津","南川","潼南","铜梁","大足","荣昌","璧山","綦江","长寿","武隆","丰都","忠县","开县","云阳","奉节","巫溪","巫山","壁山","垫江","城口","梁平","酉阳","石柱","秀山","彭水","甘肃","兰州","天水","白银","金昌","嘉峪关","临夏","合作","平凉","西峰","武威","张掖","酒泉","玉门","敦煌","永靖","夏河","和政","广河","康乐","临洮","碌曲","玛曲","临潭","卓尼","岷县","宕昌","迭部","舟曲","榆中","定西","会宁","静宁","通渭","渭源","陇西","漳县","武山","甘谷","秦安","清水","礼县","西和","两当","徽县","成县","武都","康县","文县","庄浪","华亭","崇信","灵台","泾川","宁县","正宁","合水","镇原","庆阳","环县","华池","皋兰","靖远","景泰","永登","古浪","民勤","永昌","山丹","民乐","临泽","高台","金塔","安西","宁夏","银川","石嘴山","吴忠","中卫","固原","灵武","青铜峡","青海","西宁","格尔木","德令哈","陕西","西安","渭南","铜川","延安","咸阳","宝鸡","汉中","华阴","韩城","榆林","兴平","安康","商州","长安","泾阳","三原","高陵","富平","华县","潼关","大荔","蒲城","白水","澄城","合阳","耀县","宜君","黄陵","黄龙","洛川","富县","宜川","甘泉","延长","延川","清涧","子长","安塞","志丹","吴旗","定边","靖边","横山","子洲","绥德","吴堡","米脂","佳县","神木","府谷","淳化","旬邑","彬县","长武","户县","周至","武功","礼泉","乾县","永寿","麟游","扶风","眉县","凤翔","千阳","陇县","太白","凤县","留坝","略阳","宁强","勉县","南郑","城固","洋县","西乡","镇巴","佛坪","宁陕","石泉","汉阴","紫阳","岚皋","平利","镇坪","旬阳","白河","镇安","柞水","蓝田","洛南","丹凤","商南","山阳","新疆","乌鲁木齐","克拉玛依","石河子","阿拉尔","图木舒克","五家渠","喀什","阿克苏","和田","吐鲁番","哈密","阿图什","博乐","昌吉","阜康","米泉","库尔勒","伊宁","奎屯","塔城","乌苏","阿勒泰"],"main":["测试文章","1","2222","ccccc","assdf","asdf","对不对","对","不对"],"suffix":["使用说明","价格","服务","供应","注意事项","行情","最新行情","公司动态","商家","详细解读","推荐","精华","点击查看","品牌","报价","必看","组图","详情","优质商家","大图","点击","查询","咨询","商情","优惠","图","查看","多图","怎么样","好不好","效果好吗？","效果怎么样？","在哪里？","诚信商家？","有优惠吗？","加盟费多少？","怎么代理？","怎么办？","真的靠谱吗？","火吗？","优惠价多少？","1"]}
     */

    private int status;
    private String msg;
    private DataBean data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        private List<String> prefix;
        private List<String> main;
        private List<String> suffix;
        private List<String> head;
        private List<String> news_title;
        private List<String> question_title;

        public List<String> getPrefix() {
            return prefix;
        }

        public void setPrefix(List<String> prefix) {
            this.prefix = prefix;
        }

        public List<String> getMain() {
            return main;
        }

        public void setMain(List<String> main) {
            this.main = main;
        }

        public List<String> getSuffix() {
            return suffix;
        }

        public void setSuffix(List<String> suffix) {
            this.suffix = suffix;
        }

        public List<String> getHead() {
            return head;
        }

        public void setHead(List<String> head) {
            this.head = head;
        }

        public List<String> getNews_title() {
            return news_title;
        }

        public void setNews_title(List<String> news_title) {
            this.news_title = news_title;
        }

        public List<String> getQuestion_title() {
            return question_title;
        }

        public void setQuestion_title(List<String> question_title) {
            this.question_title = question_title;
        }
    }
}
